app/views/films/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."film_id" = $1  [["film_id", 69]]
---

    <% @film.comments.each do |comment| %>